/* 
   Localized.strings
   iDeploy

   Created by Jesse Wesson on 1/3/12.
   Copyright 2012 Microsoft Corporation. All rights reserved.
 */


IDDeployControllerUsage = "Usage: iDeploy [-h|--help] [-v|--version] [-i|--install /path/to/IPA]] | [-u|--uninstall application.bundle.id] | [-l|--launch URLScheme] [-d|--device UDID]\n";

/* error messages */

IDDeployControllerResultFailure								=	"unknown error";
IDDeployControllerResultErrorWithArguments					=	"error parsing arguments";

/* list action */
IDDeployControllerResultErrorNoDevicesFound					=	"error no devices found";

/* install and uninstall actions */
IDDeployControllerResultErrorAXAPINotEnabled				=	"if install or uninstall have been specified, access for assistive devices must be enabled";
IDDeployControllerResultErrorIPCUNotFound					=	"error finding iPhone Configuration Utility.app";
IDDeployControllerResultErrorLaunchingIPCU					=	"error launching iPhone Configuration Utility";
IDDeployControllerResultErroServiceIsInvalid				=	"service is invalid (0xE8000022)";
IDDeployControllerResultErrorDeviceNotFound					=	"device not found";
IDDeployControllerResultErrorAppNotFound					=	"application not found";
IDDeployControllerResultErrorInstallingApp					=	"error installing application";
IDDeployControllerResultErrorUninstallingApp				=	"error uninstalling application";
IDDeployControllerResultErrorInstallingToUnsupportedDevice	=	"installing to unsupported device";

/* launch action */
IDDeployControllerResultErrorInstrumentsNotFound			=	"error finding instruments command-line tool";
IDDeployControllerResultErrorInstrumentsUsageError			=	"device failed to become ready for use";
IDDeployControllerResultErrorLaunchingApp					=	"error launching application";
IDDeployControllerResultErrorURLCannotBeOpened				=	"URL cannot be opened";
IDDeployControllerResultErrorDeviceLocked					=	"device is locked";
IDDeployControllerResultErrorConnectionLost					=	"device connection lost";
